## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform
[command]/home/runner/work/_temp/b56ba0a1-c97b-4fa4-ba4d-f53b7453427c/terraform-bin show -no-color main.tfplan

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.ResourceGroup.azurerm_resource_group.test-resource-group will be created
  + resource "azurerm_resource_group" "test-resource-group" {
      + id       = (known after apply)
      + location = "westus"
      + name     = "RG-aharotest01-TF"
      + tags     = {
          + "Contact"     = "Andres Haro"
          + "Department"  = "CyberSecurity"
          + "Environment" = "Testing"
          + "Project"     = "Terraform"
          + "Support"     = "test@test.com"
        }
    }

  # module.StorageAccountContainer.azurerm_storage_container.az-storage-account-container will be created
  + resource "azurerm_storage_container" "az-storage-account-container" {
      + container_access_type             = "private"
      + default_encryption_scope          = (known after apply)
      + encryption_scope_override_enabled = true
      + has_immutability_policy           = (known after apply)
      + has_legal_hold                    = (known after apply)
      + id                                = (known after apply)
      + metadata                          = (known after apply)
      + name                              = "aharocontainer"
      + resource_manager_id               = (known after apply)
      + storage_account_id                = (known after apply)
    }

  # module.StorageAccounts.azurerm_storage_account.az-storage-account will be created
  + resource "azurerm_storage_account" "az-storage-account" {
      + access_tier                        = (known after apply)
      + account_kind                       = "StorageV2"
      + account_replication_type           = "GRS"
      + account_tier                       = "Standard"
      + allow_nested_items_to_be_public    = true
      + cross_tenant_replication_enabled   = false
      + default_to_oauth_authentication    = false
      + dns_endpoint_type                  = "Standard"
      + https_traffic_only_enabled         = true
      + id                                 = (known after apply)
      + infrastructure_encryption_enabled  = false
      + is_hns_enabled                     = false
      + large_file_share_enabled           = (known after apply)
      + local_user_enabled                 = true
      + location                           = "westus"
      + min_tls_version                    = "TLS1_2"
      + name                               = "staharostoragetf"
      + nfsv3_enabled                      = false
      + primary_access_key                 = (sensitive value)
      + primary_blob_connection_string     = (sensitive value)
      + primary_blob_endpoint              = (known after apply)
      + primary_blob_host                  = (known after apply)
      + primary_blob_internet_endpoint     = (known after apply)
      + primary_blob_internet_host         = (known after apply)
      + primary_blob_microsoft_endpoint    = (known after apply)
      + primary_blob_microsoft_host        = (known after apply)
      + primary_connection_string          = (sensitive value)
      + primary_dfs_endpoint               = (known after apply)
      + primary_dfs_host                   = (known after apply)
      + primary_dfs_internet_endpoint      = (known after apply)
      + primary_dfs_internet_host          = (known after apply)
      + primary_dfs_microsoft_endpoint     = (known after apply)
      + primary_dfs_microsoft_host         = (known after apply)
      + primary_file_endpoint              = (known after apply)
      + primary_file_host                  = (known after apply)
      + primary_file_internet_endpoint     = (known after apply)
      + primary_file_internet_host         = (known after apply)
      + primary_file_microsoft_endpoint    = (known after apply)
      + primary_file_microsoft_host        = (known after apply)
      + primary_location                   = (known after apply)
      + primary_queue_endpoint             = (known after apply)
      + primary_queue_host                 = (known after apply)
      + primary_queue_microsoft_endpoint   = (known after apply)
      + primary_queue_microsoft_host       = (known after apply)
      + primary_table_endpoint             = (known after apply)
      + primary_table_host                 = (known after apply)
      + primary_table_microsoft_endpoint   = (known after apply)
      + primary_table_microsoft_host       = (known after apply)
      + primary_web_endpoint               = (known after apply)
      + primary_web_host                   = (known after apply)
      + primary_web_internet_endpoint      = (known after apply)
      + primary_web_internet_host          = (known after apply)
      + primary_web_microsoft_endpoint     = (known after apply)
      + primary_web_microsoft_host         = (known after apply)
      + public_network_access_enabled      = false
      + queue_encryption_key_type          = "Service"
      + resource_group_name                = "RG-aharotest01-TF"
      + secondary_access_key               = (sensitive value)
      + secondary_blob_connection_string   = (sensitive value)
      + secondary_blob_endpoint            = (known after apply)
      + secondary_blob_host                = (known after apply)
      + secondary_blob_internet_endpoint   = (known after apply)
      + secondary_blob_internet_host       = (known after apply)
      + secondary_blob_microsoft_endpoint  = (known after apply)
      + secondary_blob_microsoft_host      = (known after apply)
      + secondary_connection_string        = (sensitive value)
      + secondary_dfs_endpoint             = (known after apply)
      + secondary_dfs_host                 = (known after apply)
      + secondary_dfs_internet_endpoint    = (known after apply)
      + secondary_dfs_internet_host        = (known after apply)
      + secondary_dfs_microsoft_endpoint   = (known after apply)
      + secondary_dfs_microsoft_host       = (known after apply)
      + secondary_file_endpoint            = (known after apply)
      + secondary_file_host                = (known after apply)
      + secondary_file_internet_endpoint   = (known after apply)
      + secondary_file_internet_host       = (known after apply)
      + secondary_file_microsoft_endpoint  = (known after apply)
      + secondary_file_microsoft_host      = (known after apply)
      + secondary_location                 = (known after apply)
      + secondary_queue_endpoint           = (known after apply)
      + secondary_queue_host               = (known after apply)
      + secondary_queue_microsoft_endpoint = (known after apply)
      + secondary_queue_microsoft_host     = (known after apply)
      + secondary_table_endpoint           = (known after apply)
      + secondary_table_host               = (known after apply)
      + secondary_table_microsoft_endpoint = (known after apply)
      + secondary_table_microsoft_host     = (known after apply)
      + secondary_web_endpoint             = (known after apply)
      + secondary_web_host                 = (known after apply)
      + secondary_web_internet_endpoint    = (known after apply)
      + secondary_web_internet_host        = (known after apply)
      + secondary_web_microsoft_endpoint   = (known after apply)
      + secondary_web_microsoft_host       = (known after apply)
      + sftp_enabled                       = false
      + shared_access_key_enabled          = true
      + table_encryption_key_type          = "Service"
      + tags                               = {
          + "Contact"     = "Andres Haro"
          + "Department"  = "CyberSecurity"
          + "Environment" = "Testing"
          + "Project"     = "Terraform"
          + "Support"     = "test@test.com"
        }

      + blob_properties (known after apply)

      + network_rules (known after apply)

      + queue_properties (known after apply)

      + routing (known after apply)

      + share_properties (known after apply)

      + static_website (known after apply)
    }

  # module.gh_federated_credential.azurerm_federated_identity_credential.cred will be created
  + resource "azurerm_federated_identity_credential" "cred" {
      + audience            = [
          + "api://AzureADTokenExchange",
        ]
      + id                  = (known after apply)
      + issuer              = "https://token.actions.githubusercontent.com"
      + name                = "hvaandres-azure-terraform-dev"
      + parent_id           = (known after apply)
      + resource_group_name = "RG-aharo-test01-identity"
      + subject             = "repo:hvaandres/azure-terraform:environment:dev"
    }

  # module.gh_federated_credential-pr.azurerm_federated_identity_credential.cred will be created
  + resource "azurerm_federated_identity_credential" "cred" {
      + audience            = [
          + "api://AzureADTokenExchange",
        ]
      + id                  = (known after apply)
      + issuer              = "https://token.actions.githubusercontent.com"
      + name                = "hvaandres-azure-terraform-pr"
      + parent_id           = (known after apply)
      + resource_group_name = "RG-aharo-test01-identity"
      + subject             = "repo:hvaandres/azure-terraform:pull_request"
    }

  # module.gh_usi.azurerm_user_assigned_identity.msi will be created
  + resource "azurerm_user_assigned_identity" "msi" {
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + location            = "westus"
      + name                = "aharo-identity"
      + principal_id        = (known after apply)
      + resource_group_name = "RG-aharo-test01-identity"
      + tags                = {
          + "Contact"     = "Alan Haro"
          + "Department"  = "CyberSecurity"
          + "Environment" = "Testing"
          + "Project"     = "Terraform"
          + "Support"     = "alan.haro@dev.com"
        }
      + tenant_id           = (known after apply)
    }

  # module.identity-resource-group.azurerm_resource_group.identity_rg_name will be created
  + resource "azurerm_resource_group" "identity_rg_name" {
      + id       = (known after apply)
      + location = "westus"
      + name     = "RG-aharo-test01-identity"
      + tags     = {
          + "Contact"     = "Alan Haro"
          + "Department"  = "CyberSecurity"
          + "Environment" = "Testing"
          + "Project"     = "Terraform"
          + "Support"     = "support@support.com"
        }
    }

  # module.sub_owner_role_assignment.azurerm_role_assignment.role will be created
  + resource "azurerm_role_assignment" "role" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Owner"
      + scope                            = "/subscriptions/758d3524-88ef-4e09-b4aa-46caa03594ef"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.tfstate_role_assignment.azurerm_role_assignment.role will be created
  + resource "azurerm_role_assignment" "role" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 9 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + federated_identity_credential_id    = (known after apply)
  + federated_identity_credential_pr_id = (known after apply)
  + identity_resource_group_name        = "RG-aharo-test01-identity"
  + resource_group_location             = "westus"
  + resource_group_name                 = "RG-aharotest01-TF"
  + storage_account_container_id        = (known after apply)
  + storage_account_id                  = (known after apply)
  + subscription_id                     = "/subscriptions/758d3524-88ef-4e09-b4aa-46caa03594ef"
::debug::Terraform exited with code 0.
::debug::stdout: %0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform will perform the following actions:%0A%0A  # module.ResourceGroup.azurerm_resource_group.test-resource-group will be created%0A  + resource "azurerm_resource_group" "test-resource-group" {%0A      + id       = (known after apply)%0A      + location = "westus"%0A      + name     = "RG-aharotest01-TF"%0A      + tags     = {%0A          + "Contact"     = "Andres Haro"%0A          + "Department"  = "CyberSecurity"%0A          + "Environment" = "Testing"%0A          + "Project"     = "Terraform"%0A          + "Support"     = "test@test.com"%0A        }%0A    }%0A%0A  # module.StorageAccountContainer.azurerm_storage_container.az-storage-account-container will be created%0A  + resource "azurerm_storage_container" "az-storage-account-container" {%0A      + container_access_type             = "private"%0A      + default_encryption_scope          = (known after apply)%0A      + encryption_scope_override_enabled = true%0A      + has_immutability_policy           = (known after apply)%0A      + has_legal_hold                    = (known after apply)%0A      + id                                = (known after apply)%0A      + metadata                          = (known after apply)%0A      + name                              = "aharocontainer"%0A      + resource_manager_id               = (known after apply)%0A      + storage_account_id                = (known after apply)%0A    }%0A%0A  # module.StorageAccounts.azurerm_storage_account.az-storage-account will be created%0A  + resource "azurerm_storage_account" "az-storage-account" {%0A      + access_tier                        = (known after apply)%0A      + account_kind                       = "StorageV2"%0A      + account_replication_type           = "GRS"%0A      + account_tier                       = "Standard"%0A      + allow_nested_items_to_be_public    = true%0A      + cross_tenant_replication_enabled   = false%0A      + default_to_oauth_authentication    = false%0A      + dns_endpoint_type                  = "Standard"%0A      + https_traffic_only_enabled         = true%0A      + id                                 = (known after apply)%0A      + infrastructure_encryption_enabled  = false%0A      + is_hns_enabled                     = false%0A      + large_file_share_enabled           = (known after apply)%0A      + local_user_enabled                 = true%0A      + location                           = "westus"%0A      + min_tls_version                    = "TLS1_2"%0A      + name                               = "staharostoragetf"%0A      + nfsv3_enabled                      = false%0A      + primary_access_key                 = (sensitive value)%0A      + primary_blob_connection_string     = (sensitive value)%0A      + primary_blob_endpoint              = (known after apply)%0A      + primary_blob_host                  = (known after apply)%0A      + primary_blob_internet_endpoint     = (known after apply)%0A      + primary_blob_internet_host         = (known after apply)%0A      + primary_blob_microsoft_endpoint    = (known after apply)%0A      + primary_blob_microsoft_host        = (known after apply)%0A      + primary_connection_string          = (sensitive value)%0A      + primary_dfs_endpoint               = (known after apply)%0A      + primary_dfs_host                   = (known after apply)%0A      + primary_dfs_internet_endpoint      = (known after apply)%0A      + primary_dfs_internet_host          = (known after apply)%0A      + primary_dfs_microsoft_endpoint     = (known after apply)%0A      + primary_dfs_microsoft_host         = (known after apply)%0A      + primary_file_endpoint              = (known after apply)%0A      + primary_file_host                  = (known after apply)%0A      + primary_file_internet_endpoint     = (known after apply)%0A      + primary_file_internet_host         = (known after apply)%0A      + primary_file_microsoft_endpoint    = (known after apply)%0A      + primary_file_microsoft_host        = (known after apply)%0A      + primary_location                   = (known after apply)%0A      + primary_queue_endpoint             = (known after apply)%0A      + primary_queue_host                 = (known after apply)%0A      + primary_queue_microsoft_endpoint   = (known after apply)%0A      + primary_queue_microsoft_host       = (known after apply)%0A      + primary_table_endpoint             = (known after apply)%0A      + primary_table_host                 = (known after apply)%0A      + primary_table_microsoft_endpoint   = (known after apply)%0A      + primary_table_microsoft_host       = (known after apply)%0A      + primary_web_endpoint               = (known after apply)%0A      + primary_web_host                   = (known after apply)%0A      + primary_web_internet_endpoint      = (known after apply)%0A      + primary_web_internet_host          = (known after apply)%0A      + primary_web_microsoft_endpoint     = (known after apply)%0A      + primary_web_microsoft_host         = (known after apply)%0A      + public_network_access_enabled      = false%0A      + queue_encryption_key_type          = "Service"%0A      + resource_group_name                = "RG-aharotest01-TF"%0A      + secondary_access_key               = (sensitive value)%0A      + secondary_blob_connection_string   = (sensitive value)%0A      + secondary_blob_endpoint            = (known after apply)%0A      + secondary_blob_host                = (known after apply)%0A      + secondary_blob_internet_endpoint   = (known after apply)%0A      + secondary_blob_internet_host       = (known after apply)%0A      + secondary_blob_microsoft_endpoint  = (known after apply)%0A      + secondary_blob_microsoft_host      = (known after apply)%0A      + secondary_connection_string        = (sensitive value)%0A      + secondary_dfs_endpoint             = (known after apply)%0A      + secondary_dfs_host                 = (known after apply)%0A      + secondary_dfs_internet_endpoint    = (known after apply)%0A      + secondary_dfs_internet_host        = (known after apply)%0A      + secondary_dfs_microsoft_endpoint   = (known after apply)%0A      + secondary_dfs_microsoft_host       = (known after apply)%0A      + secondary_file_endpoint            = (known after apply)%0A      + secondary_file_host                = (known after apply)%0A      + secondary_file_internet_endpoint   = (known after apply)%0A      + secondary_file_internet_host       = (known after apply)%0A      + secondary_file_microsoft_endpoint  = (known after apply)%0A      + secondary_file_microsoft_host      = (known after apply)%0A      + secondary_location                 = (known after apply)%0A      + secondary_queue_endpoint           = (known after apply)%0A      + secondary_queue_host               = (known after apply)%0A      + secondary_queue_microsoft_endpoint = (known after apply)%0A      + secondary_queue_microsoft_host     = (known after apply)%0A      + secondary_table_endpoint           = (known after apply)%0A      + secondary_table_host               = (known after apply)%0A      + secondary_table_microsoft_endpoint = (known after apply)%0A      + secondary_table_microsoft_host     = (known after apply)%0A      + secondary_web_endpoint             = (known after apply)%0A      + secondary_web_host                 = (known after apply)%0A      + secondary_web_internet_endpoint    = (known after apply)%0A      + secondary_web_internet_host        = (known after apply)%0A      + secondary_web_microsoft_endpoint   = (known after apply)%0A      + secondary_web_microsoft_host       = (known after apply)%0A      + sftp_enabled                       = false%0A      + shared_access_key_enabled          = true%0A      + table_encryption_key_type          = "Service"%0A      + tags                               = {%0A          + "Contact"     = "Andres Haro"%0A          + "Department"  = "CyberSecurity"%0A          + "Environment" = "Testing"%0A          + "Project"     = "Terraform"%0A          + "Support"     = "test@test.com"%0A        }%0A%0A      + blob_properties (known after apply)%0A%0A      + network_rules (known after apply)%0A%0A      + queue_properties (known after apply)%0A%0A      + routing (known after apply)%0A%0A      + share_properties (known after apply)%0A%0A      + static_website (known after apply)%0A    }%0A%0A  # module.gh_federated_credential.azurerm_federated_identity_credential.cred will be created%0A  + resource "azurerm_federated_identity_credential" "cred" {%0A      + audience            = [%0A          + "api://AzureADTokenExchange",%0A        ]%0A      + id                  = (known after apply)%0A      + issuer              = "https://token.actions.githubusercontent.com"%0A      + name                = "hvaandres-azure-terraform-dev"%0A      + parent_id           = (known after apply)%0A      + resource_group_name = "RG-aharo-test01-identity"%0A      + subject             = "repo:hvaandres/azure-terraform:environment:dev"%0A    }%0A%0A  # module.gh_federated_credential-pr.azurerm_federated_identity_credential.cred will be created%0A  + resource "azurerm_federated_identity_credential" "cred" {%0A      + audience            = [%0A          + "api://AzureADTokenExchange",%0A        ]%0A      + id                  = (known after apply)%0A      + issuer              = "https://token.actions.githubusercontent.com"%0A      + name                = "hvaandres-azure-terraform-pr"%0A      + parent_id           = (known after apply)%0A      + resource_group_name = "RG-aharo-test01-identity"%0A      + subject             = "repo:hvaandres/azure-terraform:pull_request"%0A    }%0A%0A  # module.gh_usi.azurerm_user_assigned_identity.msi will be created%0A  + resource "azurerm_user_assigned_identity" "msi" {%0A      + client_id           = (known after apply)%0A      + id                  = (known after apply)%0A      + location            = "westus"%0A      + name                = "aharo-identity"%0A      + principal_id        = (known after apply)%0A      + resource_group_name = "RG-aharo-test01-identity"%0A      + tags                = {%0A          + "Contact"     = "Alan Haro"%0A          + "Department"  = "CyberSecurity"%0A          + "Environment" = "Testing"%0A          + "Project"     = "Terraform"%0A          + "Support"     = "alan.haro@dev.com"%0A        }%0A      + tenant_id           = (known after apply)%0A    }%0A%0A  # module.identity-resource-group.azurerm_resource_group.identity_rg_name will be created%0A  + resource "azurerm_resource_group" "identity_rg_name" {%0A      + id       = (known after apply)%0A      + location = "westus"%0A      + name     = "RG-aharo-test01-identity"%0A      + tags     = {%0A          + "Contact"     = "Alan Haro"%0A          + "Department"  = "CyberSecurity"%0A          + "Environment" = "Testing"%0A          + "Project"     = "Terraform"%0A          + "Support"     = "support@support.com"%0A        }%0A    }%0A%0A  # module.sub_owner_role_assignment.azurerm_role_assignment.role will be created%0A  + resource "azurerm_role_assignment" "role" {%0A      + condition_version                = (known after apply)%0A      + id                               = (known after apply)%0A      + name                             = (known after apply)%0A      + principal_id                     = (known after apply)%0A      + principal_type                   = (known after apply)%0A      + role_definition_id               = (known after apply)%0A      + role_definition_name             = "Owner"%0A      + scope                            = "/subscriptions/758d3524-88ef-4e09-b4aa-46caa03594ef"%0A      + skip_service_principal_aad_check = (known after apply)%0A    }%0A%0A  # module.tfstate_role_assignment.azurerm_role_assignment.role will be created%0A  + resource "azurerm_role_assignment" "role" {%0A      + condition_version                = (known after apply)%0A      + id                               = (known after apply)%0A      + name                             = (known after apply)%0A      + principal_id                     = (known after apply)%0A      + principal_type                   = (known after apply)%0A      + role_definition_id               = (known after apply)%0A      + role_definition_name             = "Storage Blob Data Contributor"%0A      + scope                            = (known after apply)%0A      + skip_service_principal_aad_check = (known after apply)%0A    }%0A%0APlan: 9 to add, 0 to change, 0 to destroy.%0A%0AChanges to Outputs:%0A  + federated_identity_credential_id    = (known after apply)%0A  + federated_identity_credential_pr_id = (known after apply)%0A  + identity_resource_group_name        = "RG-aharo-test01-identity"%0A  + resource_group_location             = "westus"%0A  + resource_group_name                 = "RG-aharotest01-TF"%0A  + storage_account_container_id        = (known after apply)%0A  + storage_account_id                  = (known after apply)%0A  + subscription_id                     = "/subscriptions/758d3524-88ef-4e09-b4aa-46caa03594ef"%0A
::debug::stderr: 
::debug::exitcode: 0
```
</details>